### Performing merging in DataSets

In [2]:
import pandas as pd 

# First DataFrame: student info
students = pd.DataFrame({
    'Student_ID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Carol', 'Dan'],
    'Grade': ['A', 'B', 'A', 'C']
})

# Second DataFrame: student marks
marks = pd.DataFrame({
    'Student_ID': [101, 102, 104, 105],
    'Maths': [85, 90, 70, 88],
    'Science': [80, 95, 75, 91]
})

In [ ]:
# Merge on a Common Key (INNER JOIN)
merged_df = pd.merge(students,marks)
merged_df

   Student_ID   Name Grade  Maths  Science
0         101  Alice     A     85       80
1         102    Bob     B     90       95
2         104    Dan     C     70       75

In [5]:
merged_df = pd.merge(students,marks,on='Student_ID')
merged_df

   Student_ID   Name Grade  Maths  Science
0         101  Alice     A     85       80
1         102    Bob     B     90       95
2         104    Dan     C     70       75

In [9]:
# Working with other types of joins

left = pd.DataFrame({
    'ID' : [1,2,3,4],
    'Name' : ['Ram','Shyam','Hari','Sita']
})

right = pd.DataFrame({
    'ID' : [3,4,5,6],
    'Subject' : ['Science','Statistics','Maths','English']
})

In [11]:
left_merge = pd.merge(left,right,on='ID',how='left')
left_merge

   ID   Name     Subject
0   1    Ram         NaN
1   2  Shyam         NaN
2   3   Hari     Science
3   4   Sita  Statistics

In [14]:
right_merge = pd.merge(left,right,on='ID',how='right')
right_merge

   ID  Name     Subject
0   3  Hari     Science
1   4  Sita  Statistics
2   5   NaN       Maths
3   6   NaN     English